Bob-the-Kuhn/bootloader_SDIO/src/stm32-bootloader/bootloader.c
    HAL_FLASH_Unlock();  
    
    LED_G1_ON(); 
    LED_G2_OFF();
    #define NBPAGES (FLASH_SIZE/FLASH_SECTOR_SIZE - APP_first_sector)
    #define FLASH_INCR 25  // number of pages to erase before reporting status
    for (uint16_t count = 0; count < NBPAGES; count += FLASH_INCR) {
      pEraseInit.PageAddress = APP_first_addr + count * FLASH_SECTOR_SIZE;       // address within first page to erase
      pEraseInit.NbPages = ((count + FLASH_INCR) < NBPAGES) ? 25 : (NBPAGES - count); // number pages to erase this loop
      sprintf(msg, "Erasing page: %u\n", APP_first_sector + count);
      LED_ALL_TG();
      print(msg);
      HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&pEraseInit, &PageError);
      if ((status != HAL_OK) | (PageError != 0xFFFFFFFF)) {
        sprintf(msg, "ERROR: status:    %u\n", status);
        print(msg);
        sprintf(msg, "ERROR: PageError: %08lX\n", PageError);
        print(msg);
      }
    }
    
    HAL_FLASH_Lock();                 
    return (PageError == 0xFFFFFFFF) ? BL_OK : BL_ERASE_ERROR;
}

/**
 * @brief  Begin flash programming: this function unlocks the flash and sets
 *         the data pointer to the start of application flash area.
 * @see    README for futher information
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK is returned in every case
 */
uint8_t Bootloader_FlashBegin(void)
{
    /* Reset flash destination address */
    flash_ptr = APP_ADDRESS;

    /* Unlock flash */
    HAL_FLASH_Unlock();
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_WRPERR | FLASH_FLAG_PGERR);

    return BL_OK;
}



/**
 * @brief  Program 16 bit data into flash: this function writes an 2 byte (16 bit)
 *         data chunk into the flash and increments the data pointer.
 * @see    README for futher information
 * @param  data: pointer to buffer with data to be written into flash
                 buffer needs to be 16 bit word aligned to match FLASH writes
           count: number of bytes in the buffer
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: upon success
 * @retval BL_WRITE_ERROR: upon failure
 */
uint8_t Bootloader_FlashNext_Buf(uint8_t *data, UINT count)
{
    if(!(flash_ptr <= (FLASH_BASE + FLASH_SIZE - count)) ||
       (flash_ptr < APP_ADDRESS))
    {
        HAL_FLASH_Lock();
        return BL_WRITE_ERROR;
    }

    uint16_t read_data;
    uint16_t data_16;
    uint16_t i;
    for (i = 0; i < count/2; i++) {
      data_16 = (uint16_t) (*data  + (*(data+1) << 8));  // assemble two bytes
      SET_BIT(FLASH->CR, FLASH_CR_PG);  // tell FLASH controller we'll be writing to FLASH
      *(__IO uint16_t*)flash_ptr = data_16;
      read_data = *(uint16_t*)flash_ptr;
      if (read_data != data_16)            
      {
      /* Flash content doesn't match source content */
        HAL_FLASH_Lock();
        print("Programming error\n");
        sprintf(msg, "expected data (16 bit): %04X\n", data_16);
        print(msg);   
        sprintf(msg, "actual data (16 bit)  : %04X\n", read_data);
        print(msg);   
        sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
        print(msg);
    
        HAL_FLASH_Lock();
        return BL_WRITE_ERROR;
      }
      flash_ptr += 2;
      data += 2;
    } 
    
    if (count%2) {  // have an odd number of bytes - need to pad it out & write it - this will only happen at the end of the file
      data_16 = ((*data << 8) + *(data+1));  // assemble two bytes into a
      SET_BIT(FLASH->CR, FLASH_CR_PG);  // tell FLASH controller we'll be writing to FLASH
      *(__IO uint16_t*)flash_ptr = data_16;
      read_data = *(uint16_t*)flash_ptr;
      if(read_data != data_16)            
      {
      /* Flash content doesn't match source content */
        HAL_FLASH_Lock();
        print("Programming error\n");
        sprintf(msg, "expected data (16 bit): %04X\n", data_16);
        print(msg);   
        sprintf(msg, "actual data (16 bit)  : %04X\n", read_data);
        print(msg);   
        sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
        print(msg);
        
        HAL_FLASH_Lock();
        return BL_WRITE_ERROR;
      }
    }
     
    if (FLASH->CR & (FLASH_FLAG_WRPERR | FLASH_FLAG_PGERR)) return BL_WRITE_ERROR;

    HAL_FLASH_Lock();
    return BL_OK;
}

/**
 * @brief  Program 64bit data into flash: this function writes an 8byte (64bit)
 *         data chunk into the flash and increments the data pointer.
 * @see    README for futher information
 * @param  data: 64bit data chunk to be written into flash
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: upon success
 * @retval BL_WRITE_ERROR: upon failure
 */
uint8_t Bootloader_FlashNext(uint64_t data)
{
    HAL_StatusTypeDef status = HAL_OK; //debug
    if(!(flash_ptr <= (FLASH_BASE + FLASH_SIZE - 8)) ||
       (flash_ptr < APP_ADDRESS))
    {
        HAL_FLASH_Lock();
        return BL_WRITE_ERROR;
    }

    uint64_t read_data;
    status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, flash_ptr, data);
    if(status == HAL_OK)
    {
        /* Check the written value */
        read_data = *(uint64_t*)flash_ptr; 
        if(read_data != data)            
        {
            /* Flash content doesn't match source content */
                HAL_FLASH_Lock();
                print("Programming error\n");
                sprintf(msg, "expected data (64 bit): %08lX %08lX\n", (uint32_t) (data >> 32) ,(uint32_t) data);
                print(msg);   
                sprintf(msg, "actual data (64 bit)  : %08lX %08lX\n", (uint32_t) (read_data >> 32) ,(uint32_t) read_data);
                print(msg);   
                sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
                print(msg);
            
            HAL_FLASH_Lock();
            return BL_WRITE_ERROR;
        }
        /* Increment Flash destination address */
        flash_ptr += 8;
    }
    else
    {
        /* Error occurred while writing data into Flash */ 
        HAL_FLASH_Lock();
        
        sprintf(msg, "programming error - status: %04X\n", status);
        print(msg);
        
