Bob-the-Kuhn/bootloader_SDIO/src/stm32-bootloader/bootloader.c
        sprintf(msg, "absolute address (byte): %08lX\n", flash_ptr);
        print(msg);
        
        sprintf(msg, "sector: %08lX\n", ((flash_ptr - 0x08000000)/FLASH_SECTOR_SIZE));
        print(msg);
        
        return BL_WRITE_ERROR;
    }

    return BL_OK;
}

/**
 * @brief  Finish flash programming: this function finalizes the flash
 *         programming by locking the flash.
 * @see    README for futher information
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK is returned in every case
 */
uint8_t Bootloader_FlashEnd(void)
{
    /* Lock flash */
    HAL_FLASH_Lock();
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_WRPERR | FLASH_FLAG_PGERR);

    return BL_OK;
}

/**
 * @brief  This function returns the protection status of flash.
 * @return Flash protection status ::eFlashProtectionTypes
 */
uint32_t Bootloader_GetProtectionStatus(void)
  {
    FLASH_OBProgramInitTypeDef OBStruct = {0};

    HAL_FLASH_Unlock();

    HAL_FLASHEx_OBGetConfig(&OBStruct);
    HAL_FLASH_Lock();
    return OBStruct.WRPPage;  // 1 means NOT write protected
  }

// debug helper routine
const char *byte_to_binary (uint32_t x)
{
    static char b[33];
    b[0] = '\0';

    uint32_t z;
    for (z = 1 << 31; z > 0; z >>= 1)
    {
        strcat(b, ((x & z) == z) ? "1" : "0");
    }

    return b;
}


/********************************************************************
 * The following code is based on ST's STM32 library.
 * 
 * It has been modified so that setting and clearing the write protect
 * option bits is done in a single pass.
 * 
 * Process overview:
 *   1) save existing DATA and USER bytes
 *   2) erase option bytes
 *        This routine saves & restores the RDP byte.
 *   3) restore the DATA and USER bytes
 *   4) program the WRP bytes
 * 
 *  It does NOT save the compliments of the bytes.
 * 
 */


static HAL_StatusTypeDef FLASH_OB_ProgramOB_byte(uint32_t Address, uint8_t Data)
{
  HAL_StatusTypeDef status = HAL_ERROR;
  
  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  
  if(status == HAL_OK)
  {
    /* Clean the error context */
    //pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

    /* Enables the Option Bytes Programming operation */
    SET_BIT(FLASH->CR, FLASH_CR_OPTPG); 
    *(__IO uint16_t*)Address = Data;
    
    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
    
    /* If the program operation is completed, disable the OPTPG Bit */
    CLEAR_BIT(FLASH->CR, FLASH_CR_OPTPG);
  }
  /* Return the Option Byte Data Program Status */
  return status;
}

 
HAL_StatusTypeDef _HAL_FLASHEx_OBProgram_WRP(uint32_t WRP_bits) { 
  
//  sprintf(msg,"WRP_bits               %08lX\n", WRP_bits);
//  print(msg);
  
  
  HAL_StatusTypeDef status = HAL_OK;

  status = HAL_FLASH_Unlock();
  status |= HAL_FLASH_OB_Unlock();  // unlock option bytes
  
  if (status != HAL_OK) {print("unlock error\n"); goto QUIT;}
  
  volatile uint8_t* OB_BLOCK = (uint8_t*)0x1FFFF800UL; // pointer to option byte block
  
  // save option bytes we won't be messing with
  //uint8_t RDP   = *OB_BLOCK;  // don't mess with RDP - erase routine saves & stores it
  uint8_t USER  = *(OB_BLOCK + 2);
  uint8_t Data0 = *(OB_BLOCK + 4);
  uint8_t Data1 = *(OB_BLOCK + 6);
  
  // breakup WRP into bytes
  uint8_t WRP0 = (uint8_t) WRP_bits;
  uint8_t WRP1 = (uint8_t) (WRP_bits >> 8);
  uint8_t WRP2 = (uint8_t) (WRP_bits >> 16);
  uint8_t WRP3 = (uint8_t) (WRP_bits >> 24);

  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  
  if (status != HAL_OK) {
    print("FLASH_TIMEOUT error\n"); 
    // goto QUIT;  // try to restore the OB block no matter what
  }
  
 
  if(FLASH->CR & 1) {
    FLASH->CR &= 0xFFFFFFFE;  // clear out the PE bit
  }
  
  status |= HAL_FLASHEx_OBErase();  // erase OB block
  
  if (status != HAL_OK) {
    print("erase OB block error\n"); 
//    FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
//    status = HAL_FLASHEx_OBErase();  // erase OB block
//    if (status != HAL_OK) {
//      print("erase OB block error 2\n");
//    }
//    else {
//      status = HAL_OK;
//    }
//    
    // goto QUIT;  // try to restore the OB block no matter what
  }
  
  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  
  
  if (status != HAL_OK) {
    print("WaitForLastOperation error\n"); 
    sprintf(msg,"erase error - HAL status:          %02X\n", status);
    print(msg);
    sprintf(msg,"FLASH status register:          %08lX\n", FLASH->SR);
    print(msg);
    // goto QUIT;  // try to restore the OB block no matter what
  }   
  
  uint32_t timeout = FLASH_TIMEOUT_VALUE;

  status |= FLASH_OB_ProgramOB_byte(0x1FFFF802, USER);
  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  HAL_Delay(10);

  status |= FLASH_OB_ProgramOB_byte(0x1FFFF804, Data0);
  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  HAL_Delay(10);

  status |= FLASH_OB_ProgramOB_byte(0x1FFFF806, Data1);
  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  HAL_Delay(10);

  status |= FLASH_OB_ProgramOB_byte(0x1FFFF808, WRP0);
  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  HAL_Delay(10);

  status |= FLASH_OB_ProgramOB_byte(0x1FFFF80A, WRP1);
  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  HAL_Delay(10);

  status |= FLASH_OB_ProgramOB_byte(0x1FFFF80C, WRP2);
  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
  HAL_Delay(10);

  status |= FLASH_OB_ProgramOB_byte(0x1FFFF80E, WRP3);
  status |= FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);


  if (HAL_GetTick() >= timeout) {print("timeout - WRP3\n"); goto QUIT;}
  
  if (status != HAL_OK) print("program byte error\n"); 
  
  status |= HAL_FLASH_OB_Lock();
  status |= HAL_FLASH_Lock();
  
  if (status != HAL_OK) print("lock error\n");
  
  ////uint8_t _RDP   = *OB_BLOCK;
  //uint8_t _USER  = *(OB_BLOCK + 2);
  //uint8_t _Data0 = *(OB_BLOCK + 4);
  //uint8_t _Data1 = *(OB_BLOCK + 6);
  //uint8_t _WRP0  = *(OB_BLOCK + 8);
  //uint8_t _WRP1  = *(OB_BLOCK + 10);
  //uint8_t _WRP2  = *(OB_BLOCK + 12);
  //uint8_t _WRP3  = *(OB_BLOCK + 14);
  
  //sprintf(msg,"WRP read back          %02X%02X%02X%02X\n", _WRP3, _WRP2, _WRP1, _WRP0);
  //print(msg);
  
  //////if (RDP   != _RDP)   while(1){};
  //if (USER  != _USER)  FLASH_OB_ProgramOB_byte(0x1FFFF802, USER);
  //if (Data0 != _Data0) FLASH_OB_ProgramOB_byte(0x1FFFF804, Data0);
  //if (Data1 != _Data1) FLASH_OB_ProgramOB_byte(0x1FFFF806, Data1);
  //if (WRP0  != _WRP0)  FLASH_OB_ProgramOB_byte(0x1FFFF808, WRP0);
  //if (WRP1  != _WRP1)  FLASH_OB_ProgramOB_byte(0x1FFFF80A, WRP1);
  //if (WRP2  != _WRP2)  FLASH_OB_ProgramOB_byte(0x1FFFF80C, WRP2);
  //if (WRP3  != _WRP3)  FLASH_OB_ProgramOB_byte(0x1FFFF80E, WRP3);
  //
  //_WRP0  = *(OB_BLOCK + 8);
  //_WRP1  = *(OB_BLOCK + 10);
  //_WRP2  = *(OB_BLOCK + 12);
  //_WRP3  = *(OB_BLOCK + 14);
  //
  //
  //sprintf(msg,"WRP read back          %02X%02X%02X%02X\n", _WRP3, _WRP2, _WRP1, _WRP0);
  //print(msg);
  
 QUIT: 
  status |= HAL_FLASH_OB_Lock();
  status |= HAL_FLASH_Lock();
  
