Bob-the-Kuhn/bootloader_SDIO/src/stm32-bootloader/bootloader.c
  return status;
}
    
  
  
/**
 * @brief  This function configures the write protection of flash.
 * @param  protection: desired protection: '1' - no protection, '0' write protect
 *         mask: '1' - program per protection , '0' don't touch this bit
 *         set: unused
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: upon success
 * @retval BL_OBP_ERROR: upon failure
 *
 * 
 * Setting the protection is a three step process
 *   1) Determine final protection
 *   2) Invoke _HAL_FLASH_OB_Launch()
 *   3) Send the system through reset so that the new settings take effect
 * 
 */

uint8_t Bootloader_ConfigProtection(uint32_t protection, uint32_t mask, uint8_t set)
{
  FLASH_OBProgramInitTypeDef OBStruct = {0};
  HAL_StatusTypeDef status = HAL_ERROR;

  status = HAL_FLASH_Unlock();
  status |= HAL_FLASH_OB_Unlock();
  
  //sprintf(msg,"requested protection:  %08lX\n", protection);
  //print(msg);
  //
  //sprintf(msg,"mask:                  %08lX\n", mask);
  //print(msg);
  
  HAL_FLASHEx_OBGetConfig(&OBStruct);  // get current FLASH config
  uint32_t WRPSector_save = OBStruct.WRPPage;
  uint32_t final_protection = (protection & mask) | (WRPSector_save & ~mask);
  
  //sprintf(msg,"final_protection:      %08lX\n", final_protection);
  //print(msg);
  //
  //
  //sprintf(msg,"reported protection:   %08lX\n", WRPSector_save);
  //print(msg);
  
  status |= HAL_FLASH_OB_Lock();
  status |= HAL_FLASH_Lock();
  
  status = _HAL_FLASHEx_OBProgram_WRP(final_protection );  // set protection of affected sectors
  

  HAL_FLASH_OB_Launch();      // sends system through reset which loads the OB bytes into the registers  

  return (status == HAL_OK) ? BL_OK : BL_OBP_ERROR;
}


void save_WRP_state(void) {
  FLASH_OBProgramInitTypeDef OBStruct = {0};
  HAL_FLASHEx_OBGetConfig(&OBStruct);  // get current FLASH config
  Write_Prot_Old = OBStruct.WRPPage;
  WRITE_Prot_Old_Flag = WRITE_Prot_Original_flag;  // flag that protection was saved
}

void report_WP_ConfigProtection(void)
{
  FLASH_OBProgramInitTypeDef OBStruct = {0};
  HAL_StatusTypeDef status = HAL_ERROR;

  status = HAL_FLASH_Unlock();
  status |= HAL_FLASH_OB_Unlock();
 
  HAL_FLASHEx_OBGetConfig(&OBStruct);  // get current FLASH config
  uint32_t temp = OBStruct.WRPPage;
  
  sprintf(msg,"\nWRPPage:               %08lX\n", temp);
  print(msg);
}


/**
 * @brief  This function checks whether the new application fits into flash.
 * @param  appsize: size of application
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: if application fits into flash
 * @retval BL_SIZE_ERROR: if application does not fit into flash
 */
uint8_t Bootloader_CheckSize(uint32_t appsize)
{
    return ((FLASH_BASE + FLASH_SIZE - APP_ADDRESS) >= appsize) ? BL_OK
                                                                : BL_SIZE_ERROR;
}

/**
 * @brief  This function verifies the checksum of application located in flash.
 *         If ::USE_CHECKSUM configuration parameter is disabled then the
 *         function always returns an error code.
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: if calculated checksum matches the application checksum
 * @retval BL_CHKS_ERROR: upon checksum mismatch or when ::USE_CHECKSUM is
 *         disabled
 */
uint8_t Bootloader_VerifyChecksum(void)
{
#if(USE_CHECKSUM)
    CRC_HandleTypeDef CrcHandle;
    volatile uint32_t calculatedCrc = 0;

    __HAL_RCC_CRC_CLK_ENABLE();
    CrcHandle.Instance                     = CRC;
    CrcHandle.Init.DefaultPolynomialUse    = DEFAULT_POLYNOMIAL_ENABLE;
    CrcHandle.Init.DefaultInitValueUse     = DEFAULT_INIT_VALUE_ENABLE;
    CrcHandle.Init.InputDataInversionMode  = CRC_INPUTDATA_INVERSION_NONE;
    CrcHandle.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_DISABLE;
    CrcHandle.InputDataFormat              = CRC_INPUTDATA_FORMAT_WORDS;
    if(HAL_CRC_Init(&CrcHandle) != HAL_OK)
    {
        return BL_CHKS_ERROR;
    }

    calculatedCrc =
        HAL_CRC_Calculate(&CrcHandle, (uint32_t*)APP_ADDRESS, APP_SIZE);

    __HAL_RCC_CRC_FORCE_RESET();
    __HAL_RCC_CRC_RELEASE_RESET();

    if((*(uint32_t*)CRC_ADDRESS) == calculatedCrc)
    {
        return BL_OK;
    }
#endif
    return BL_CHKS_ERROR;
}

/**
 * @brief  This function checks whether a valid application exists in flash.
 *         The check is performed by checking the very first DWORD (4 bytes) of
 *         the application firmware. In case of a valid application, this DWORD
 *         must represent the initialization location of stack pointer - which
 *         must be within the boundaries of RAM.
 * @return Bootloader error code ::eBootloaderErrorCodes
 * @retval BL_OK: if first DWORD represents a valid stack pointer location
 * @retval BL_NO_APP: first DWORD value is out of RAM boundaries
 */
uint8_t Bootloader_CheckForApplication(void)
{
  return ((((*(uint32_t*)APP_ADDRESS) - RAM_BASE) <= RAM_SIZE) ? BL_OK : BL_NO_APP);
}

/**
 * @brief  This function performs the jump to the user application in flash.
 * @details The function carries out the following operations:
 *  - Sets the flag that we should load application after the next reset
 *  - Sends the card through reset
 *  
 *  The reset handler checks this flag and will either continue to start the
 *  bootloader or it will start the application.
 */

void Bootloader_JumpToApplication(void) {
  
  report_WP_ConfigProtection();
  
  Magic_Location = Magic_Application;  // flag that we should load application 
                                       // after the next reset
  NVIC_System_Reset();                  // send the system through reset
}

/**
 * @brief  This function performs the jump to the MCU System Memory (ST
 *         Bootloader).
 * @details The function carries out the following operations:
 *  - De-initialize the clock and peripheral configuration
 *  - Stop the systick
 *  - Remap the system flash memory
 *  - Perform the jump
 */
void Bootloader_JumpToSysMem(void)
{
//    uint32_t JumpAddress = *(__IO uint32_t*)(SYSMEM_ADDRESS + 4);
//    pFunction Jump       = (pFunction)JumpAddress;
//
//    HAL_RCC_DeInit();
//    HAL_DeInit();
//
//    SysTick->CTRL = 0;
//    SysTick->LOAD = 0;
//    SysTick->VAL  = 0;
//
//    __HAL_RCC_SYSCFG_CLK_ENABLE();
//    __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();
//
//    __set_MSP(*(__IO uint32_t*)SYSMEM_ADDRESS);
//    Jump();
//
//    while(1)
//        ;
}

/**
 * @brief  This function returns the version number of the bootloader library.
 *         Semantic versioning is used for numbering.
 * @see    Semantic versioning: https://semver.org
 * @return Bootloader version number combined into an uint32_t:
 *          - [31:24] Major version
 *          - [23:16] Minor version
 *          - [15:8]  Patch version
 *          - [7:0]   Release candidate version
 */
uint32_t Bootloader_GetVersion(void)
{
    return ((BOOTLOADER_VERSION_MAJOR << 24) |
            (BOOTLOADER_VERSION_MINOR << 16) | (BOOTLOADER_VERSION_PATCH << 8) |
            (BOOTLOADER_VERSION_RC));
}


/**
  \brief   System Reset
  \details Initiates a system reset request to reset the MCU.
 */
void NVIC_System_Reset(void)
{
  #define SCB_AIRCR_VECTKEY_Pos 16U   /*!< SCB AIRCR: VECTKEY Position */
  #define SCB_AIRCR_SYSRESETREQ_Pos 2U   /*!< SCB AIRCR: VECTKEY Position */
  volatile uint32_t* SCB_AIRCR = (uint32_t*)0xE000ED0CUL;  

*SCB_AIRCR = (uint32_t)(((0x5FAUL << SCB_AIRCR_VECTKEY_Pos) | (1 << SCB_AIRCR_SYSRESETREQ_Pos)));

  for(;;)                                                           /* wait until reset */
  {
  }
}